/**********2026.10.14 **********/
#include <stdio.h>  //必不可少，"包含"C语言标准输入/输出库的相关信息
int main(void)  //程序的可执行程序代码都在main函数中,main是主程序，必不可少，第一行代码是用来显示期望信息的
{
    printf("To c, or not C: that is the question.\n");//printf函数来自标准输入/输出库，可以产生完美的格式化输出,\n告诉printf函数执行完消息要换行
    return 0;  //表示程序终止时会向操作系统返回值0
}

/***********需要把程序转化为机器可以执行的形式。对于C程序来说，转化通常包含下列3个步骤。***********/
// ● 预处理。首先程序会被交给预处理器（preprocessor）。预处理器执行以#开头的命令（通常称为指令）。
// 预处理器有点类似于编辑器，它可以给程序添加内容，也可以修改程序。

// ● 编译。修改后的程序现在可以进入编译器（compiler）了。编译器会把程序翻译成机器指令（即目标代码）。然而，这样的程序还是不可以运行的。

// ● 链接。在最后一个步骤中，链接器（linker）把由编译器产生的目标代码和所需的其他附加代码整合在一起，这样才最终产生了完全可执行的程序。
// 这些附加代码包括程序中用到的库函数（如printf函数）。


//即使最简单的C语言程序也依赖3个关键的语言特性:指令(在编译前修改程序的编辑命令)、函数(被命名的可执行代码块,
//如main函数)和语句(程序运行时执行的命令)

//注意如何使用花括号来标出main函数的起始和结束。C语言共识:极其依赖缩写词和特殊符号，这是其简洁的原因
/*2.2.1 指令*/
//在编译C程序之前，预处理器会首先对其进行编译。我们把预处理器执行的命令称为指令。
#include <stdio.h>  //程序由这行指令开始，编译器把<stdio.h>信息"包含"到程序中，里面包含C标准输入/输出库的信息
//所有指令以#开始。区分指令和其他代码。默认只占一行，每条命令结束没有分号或其他特殊标记。

/*2.2.2 函数*/
//函数类似于其他编程语言的"过程"或"子例程"，它们是用来构建程序的构建块。C程序就是函数的集合。
//函数分两大类:一是程序员编写的函数，另一类则是作为C语言实现的一部分提供函数。把后者称为库函数(library function)
//一个程序可包含多个函数，但只有main函数是必须有的。main函数是非常特殊的：在执行程序时系统会自动调用main函数。

// #include <stdio.h>
// int main(void)   <--main前面的int表明该函数将返回一个整数值。圆括号中的void表明main函数没有参数
// {
//     printf("To c, or not C: that is the question.\n");
//     return 0;  <--两个作用:一是是main函数静止(从而结束程序)，二是指出main函数的返回值是0。后面还会详细讲main函数的返回值(9.5节)
// }
//但是我们现在始终让main函数的返回值为0，这个值表示程序正常终止。如果main函数的末尾没有return语句，程序仍能终止。
//但是，许多编辑器会产生一条警告信息(因为函数应该返回一个整数，却没有这么做) 注：前提是c99及以后标准下，且是main函数

/*2.2.3 语句*/
//语句是程序运行时执行的命令。上面的简单程序只用到两种语句:一种是返回(return)语句，另一种是函数调用(function call)语句。
//要求某个函数执行分派给它的任务称为调用这个函数。例如上面调用了printf函数。
//C语言规定每条语句都要以分号结尾。[就像任何好的规则一样，这条规则也有个例外:后面会遇到的复合语句(5.2节)就不以分号结尾。]
//由于语句可以连续占用多行，有时很难确定它的结束位置，因此用分号来向编译器显示语句的结束位置。但指令通常只占一行，因此不需要用分号结尾

/*2.2.4 显示字符串*/
//用printf函数显示一条字面串(string literal)---用一对引号包围的一系列字符，当用printf显示时，最外层双引号不会出现
//显示结束，printf函数不会自动跳至下一行，需要\n(换行符)

/*2.3 注释*/
//   /*标记注释开始，*/标记注释结束例如  /* This is a comment */
//   /*该注释可以占多行。如果遇到/*,那么编辑器读入(并且忽略)随后的内容直到遇到*/为止。
//   c99提供了另一种类型的注释，以//(两个相邻的斜杠)开始:  // This is a comment   (该注释风格在行末自动终止)

/*2.4 变量和赋值*/
//大多数程序在产生输出之间往往需要执行一系列的计算，因此需要在程序执行过程中有一种临时存储数据的方法。C语言中这类存储单元被称为变量(variable)






















