/*第二章问答*/
// main函数使用return 0或是exit(0)结尾(不过要调用<stdlib.h>库)完全等价，都是终止程序执行，并且向操作系统返回0值。

// 依据C语言标准，编译器必须用一个空格字符替换每条注释句(早期是删除):
//      a/**/b = 0    <-- 被编译器理解为:   a b = 0

// 传统风格注释(/*...*/)不允许嵌套

// float 是 floating-point 的缩写形式，它是一种存储数的方法，而这些数中的小数点是“浮动的”。
// float 类型的值通常分成两部分存储：小数部分（或者称为尾数部分）和指数部分。例如，12.0 这个数可以以 1.5×2³ 的形式存储，
// 其中 1.5 是小数部分，而 3 是指数部分。有些编程语言把这种类型称为 real 类型而不是 float 类型。

// 包含小数点但不以f结尾的常量是double型的，double型的值更精准，并且可以更大，因此给float型变量赋值时加f


/*第三章问答*/
// 转换说明%i也可以用于读写整数。%i和%d之间的区别: 在printf格式串使用中，二者没有区别。但是在scanf格式串中，%d只能与十进制(基数为10)形式整数相匹配，
// 而%i可以匹配用八进制(基数为8)、十进制或十六进制(基数为16)表示的整数。如果输入的数有前缀0(如056)，那么%i会把它作为八进制数(7.1节)来处理;
// 如果输入的数有前缀0x或0X(如0x56)，那么%i会把它作为十六进制数(7.1节)来处理。如果用户意外地将0放在数的开始处，那么用%i代替%d读取数可能会意想不到，所以建议坚持采用%d

// printf 遇到连续的 %% 时，会将其识别为特殊格式，并在屏幕上输出一个实际的 % 字符。
// (注意：这不是转义，转义是指 \n, \\ 等反斜杠操作)

// 不可能知道转义序列\t水平制表符在printf函数到底可以跳多远，打印\t的效果不是由C语言定义的，而是依赖于所使用的操作系统。水平制表符通常是8个字符宽度，但C语言本身无法保证这一点
// \t 在 C 语言层面只代表 ASCII 码 9，跳多远由操作系统和终端渲染决定，C 语言本身不做保证。

// [scanf 机制]
// 如果用户输入了“混合数据”（如 123abc）：
// 1. 如果前面有有效数值（123），scanf 会将其存入变量。
// 2. 当遇到后面的字符（a）与当前格式转换（如 %d）不匹配时，立刻停止读取。
// 3. 当前 scanf 函数终止，将不匹配的字符（a）及其后的所有数据退回（留在）缓冲区。
// 4. 这些残留字符将留给下一次 scanf 或其他输入函数（如 getchar）读取。
// 处理这种糟糕情况见本书(22.3节)的方法



